Repository: anuraagnagar/flask-internationalization
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, fr, hi

source: English
es: Inglés
fr: Anglais
hi: अंग्रेज़ी

source: Spanish
es: Español
fr: Espagnol
hi: स्पैनिश

source: French
es: Francés
fr: Français
hi: फ़्रेंच

source: Hindi
hi: हिंदी

source: What is Python?
es: ¿Qué es Python?
fr: Qu’est-ce que Python ?
hi: पायथन क्या है?

source: Summary:
es: Resumen:
fr: Résumé:
hi: सारांश:

source: in this tutorial, you’ll understand what Python programming language is and why you should start learning Python today.
es: En este tutorial, comprenderá qué es el lenguaje de programación Python y por qué debería comenzar a aprender Python hoy.
fr: dans ce didacticiel, vous comprendrez ce qu'est le langage de programmation Python et pourquoi vous devriez commencer à apprendre Python dès aujourd'hui.
hi: इस ट्यूटोरियल में, आप समझेंगे कि पायथन प्रोग्रामिंग भाषा क्या है और आपको आज ही पायथन सीखना क्यों शुरू करना चाहिए।

source: What is Python programming language?
es: ¿Qué es el lenguaje de programación Python?
fr: Qu’est-ce que le langage de programmation Python ?
hi: पायथन प्रोग्रामिंग भाषा क्या है?

source: Python is a
es: Python es un
fr: Python est un
hi: पायथन एक

source: high-level, general-purpose, interpreted
es: de alto nivel, de propósito general, interpretado
fr: de haut niveau, à usage général, interprété
hi: उच्च-स्तरीय, सामान्य-उद्देश्य, व्याख्या की गई

source: programming language.
es: lenguaje de programación.
fr: langage de programmation.
hi: प्रोग्रामिंग भाषा है।

source: High-level
es: Nivel alto
fr: Haut niveau
hi: उच्च स्तर

source: Python is a high-level programming language that makes it easy to learn. Python doesn’t require you to understand the details of the computer in order to develop programs efficiently.
es: Python es un lenguaje de programación de alto nivel que facilita su aprendizaje. Python no requiere que comprendas los detalles de la computadora para poder desarrollar programas de manera eficiente.
fr: Python est un langage de programmation de haut niveau qui facilite son apprentissage. Python ne nécessite pas que vous compreniez les détails de l'ordinateur pour développer des programmes efficacement.
hi: पायथन एक उच्च स्तरीय प्रोग्रामिंग भाषा है जो इसे सीखना आसान बनाती है। प्रोग्रामों को कुशलतापूर्वक विकसित करने के लिए पायथन को आपको कंप्यूटर के विवरण को समझने की आवश्यकता नहीं है।

source: General-purpose
es: Propósito general
fr: Usage général
hi: सामान्य उद्देश्य

source: Python is a general-purpose language. It means that you can use Python in various domains including:
es: Python es un lenguaje de propósito general. Significa que puedes usar Python en varios dominios, incluidos:
fr: Python est un langage à usage général. Cela signifie que vous pouvez utiliser Python dans divers domaines, notamment :
hi: पायथन एक सामान्य प्रयोजन वाली भाषा है। इसका मतलब है कि आप पायथन का उपयोग विभिन्न डोमेन में कर सकते हैं जिनमें शामिल हैं:

source: Web applications
es: aplicaciones web
fr: des applications Web
hi: वेब अनुप्रयोग

source: Big data applications
es: Aplicaciones de grandes datos
fr: Applications de mégadonnées
hi: बड़े डेटा अनुप्रयोग

source: Testing
es: Pruebas
fr: Essai
hi: परिक्षण

source: Automation
es: Automatización
fr: Automatisation
hi: स्वचालन

source: Data science, machine learning, and AI
es: Ciencia de datos, aprendizaje automático e inteligencia artificial
fr: Science des données, apprentissage automatique et IA
hi: डेटा साइंस, मशीन लर्निंग और एआई

source: Desktop software
es: software de escritorio
fr: Logiciel de bureau
hi: डेस्कटॉप सॉफ्टवेयर

source: Mobile apps
es: Aplicaciones móviles
fr: Application mobile
hi: मोबाइल एप्लिकेशन

source: The targeted language like SQL which can be used for querying data from relational databases.
es: El lenguaje de destino, como SQL, que se puede utilizar para consultar datos de bases de datos relacionales.
fr: Le langage ciblé comme SQL qui peut être utilisé pour interroger des données à partir de bases de données relationnelles.
hi: SQL जैसी लक्षित भाषा जिसका उपयोग रिलेशनल डेटाबेस से डेटा क्वेरी करने के लिए किया जा सकता है।

source: Interpreted
es: Interpretado
fr: Interprété
hi: व्याख्या की

source: Python is an interpreted language. To develop a Python program, you write Python code into a file called source code.
es: Python es un lenguaje interpretado. Para desarrollar un programa Python, se escribe código Python en un archivo llamado código fuente.
fr: Python est un langage interprété. Pour développer un programme Python, vous écrivez du code Python dans un fichier appelé code source.
hi: पाइथॉन एक व्याख्यात्मक भाषा है। पायथन प्रोग्राम विकसित करने के लिए, आप पायथन कोड को सोर्स कोड नामक फ़ाइल में लिखते हैं।

source: To execute the source code, you need to convert it to the machine language that the computer can understand. And the Python
es: Para ejecutar el código fuente, debe convertirlo al lenguaje de máquina que la computadora pueda entender. Y el
fr: Pour exécuter le code source, vous devez le convertir dans le langage machine que l'ordinateur peut comprendre. Et
hi: स्रोत कोड को निष्पादित करने के लिए, आपको इसे मशीनी भाषा में परिवर्तित करना होगा जिसे कंप्यूटर समझ सके। और पायथन

source: interpreter
es: intérprete
fr: interpréteur
hi: दुभाषिया

source: turns the source code, line by line, once at a time, into the machine code when the Python program executes.
es: de Python convierte el código fuente, línea por línea, una vez a la vez, en código de máquina cuando se ejecuta el programa Python.
fr: Python transforme le code source, ligne par ligne, une fois à la fois, en code machine lors de l'exécution du programme Python.
hi: जब पायथॉन प्रोग्राम निष्पादित होता है तो स्रोत कोड को, लाइन दर लाइन, एक समय में एक बार, मशीन कोड में बदल देता है।

source: Compiled languages like Java and C# use a
es: Los lenguajes compilados como Java y C# utilizan un
fr: Les langages compilés comme Java et C# utilisent un
hi: जावा और सी# जैसी संकलित भाषाएं एक

source: compiler
es: compilador
fr: compilateur
hi: कंपाइलर का उपयोग

source: that compiles the whole source code before the program executes.
es: que compila todo el código fuente antes de que se ejecute el programa.
fr: qui compile l'intégralité du code source avant l'exécution du programme.
hi: करती हैं जो प्रोग्राम निष्पादित होने से पहले संपूर्ण स्रोत कोड को संकलित करता है।

source: Why Python?
es: ¿Por qué Python?
fr: Pourquoi Python ?
hi: पाइथॉन क्यों?

source: Python increases your productivity. Python allows you to solve complex problems in less time and fewer lines of code. It’s quick to make a prototype in Python.
es: Python aumenta su productividad. Python te permite resolver problemas complejos en menos tiempo y menos líneas de código. Es rápido crear un prototipo en Python.
fr: Python augmente votre productivité. Python vous permet de résoudre des problèmes complexes en moins de temps et avec moins de lignes de code. C’est rapide de réaliser un prototype en Python.
hi: पाइथॉन आपकी उत्पादकता बढ़ाता है। पायथन आपको जटिल समस्याओं को कम समय और कोड की कम पंक्तियों में हल करने की अनुमति देता है। पाइथॉन में प्रोटोटाइप बनाना त्वरित है।

source: Python becomes a solution in many areas across industries, from web applications to data science and machine learning.
es: Python se convierte en una solución en muchas áreas de todas las industrias, desde aplicaciones web hasta ciencia de datos y aprendizaje automático.
fr: Python devient une solution dans de nombreux domaines dans tous les secteurs, des applications Web à la science des données et à l'apprentissage automatique.
hi: वेब एप्लिकेशन से लेकर डेटा साइंस और मशीन लर्निंग तक, उद्योगों के कई क्षेत्रों में पायथन एक समाधान बन गया है।

source: Python is quite easy to learn in comparison with other programming languages. Python syntax is clear and beautiful.
es: Python es bastante fácil de aprender en comparación con otros lenguajes de programación. La sintaxis de Python es clara y hermosa.
fr: Python est assez facile à apprendre par rapport aux autres langages de programmation. La syntaxe Python est claire et belle.
hi: अन्य प्रोग्रामिंग भाषाओं की तुलना में पाइथॉन को सीखना काफी आसान है। पाइथॉन सिंटैक्स स्पष्ट और सुंदर है।

source: Python has a large ecosystem that includes lots of libraries and frameworks.
es: Python tiene un gran ecosistema que incluye muchas bibliotecas y marcos.
fr: Python possède un vaste écosystème qui comprend de nombreuses bibliothèques et frameworks.
hi: पाइथॉन में एक बड़ा पारिस्थितिकी तंत्र है जिसमें बहुत सारे पुस्तकालय और ढांचे शामिल हैं।

source: Python is cross-platform. Python programs can run on Windows, Linux, and macOS.
es: Python es multiplataforma. Los programas Python pueden ejecutarse en Windows, Linux y macOS.
fr: Python est multiplateforme. Les programmes Python peuvent fonctionner sous Windows, Linux et macOS.
hi: पाइथॉन क्रॉस-प्लेटफ़ॉर्म है। पाइथॉन प्रोग्राम विंडोज़, लिनक्स और मैकओएस पर चल सकते हैं।

source: Python has a huge community. Whenever you get stuck, you can get help from an active community.
es: Python tiene una gran comunidad. Siempre que te quedes atascado, puedes obtener ayuda de una comunidad activa.
fr: Python a une énorme communauté. Chaque fois que vous êtes bloqué, vous pouvez obtenir l'aide d'une communauté active.
hi: पाइथॉन का एक बहुत बड़ा समुदाय है। जब भी आप फंस जाएं, तो आप किसी सक्रिय समुदाय से सहायता प्राप्त कर सकते हैं।

source: Python developers are in high demand.
es: Los desarrolladores de Python tienen una gran demanda.
fr: Les développeurs Python sont très demandés.
hi: पाइथॉन डेवलपर्स की काफी मांग है।

source: Summary
es: Resumen
fr: Résumé
hi: सारांश

source: Python is an interpreted, high-level, general-purpose programming language.
es: Python es un lenguaje de programación interpretado, de alto nivel y de propósito general.
fr: Python est un langage de programmation interprété, de haut niveau et à usage général.
hi: पाइथॉन एक व्याख्यात्मक, उच्च-स्तरीय, सामान्य-उद्देश्य वाली प्रोग्रामिंग भाषा है।

source: Python becomes the solution in many domains from web applications, data analysis, data science, machine learning, and AI.
es: Python se convierte en la solución en muchos dominios, desde aplicaciones web, análisis de datos, ciencia de datos, aprendizaje automático e inteligencia artificial.
fr: Python devient la solution dans de nombreux domaines : applications Web, analyse de données, science des données, apprentissage automatique et IA.
hi: वेब एप्लिकेशन, डेटा विश्लेषण, डेटा विज्ञान, मशीन लर्निंग और एआई जैसे कई डोमेन में पायथन समाधान बन गया है।

source: Use Python 3 for the new development.
es: Utilice Python 3 para el nuevo desarrollo.
fr: Utilisez Python 3 pour le nouveau développement.
hi: नए विकास के लिए Python 3 का उपयोग करें।
